2018-04-03 06:32:42 +0000  Initial pipeline context: <IDEDistributionProcessingPipelineContext: 0x7f80ec44c9d0; archive(resolved)='<IDEArchive: 0x7f80ebdce350>', distributionTask(resolved)='2', distributionMethod(resolved)='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team(resolved)='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	Chain (11, self inclusive):
	<IDEDistributionProcessingPipelineContext: 0x7f80ec44c9d0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionProcessingPipelineContext: 0x7f80ec45a2f0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ec5d46d0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ec526f30; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ec4434d0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ec3613c0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ebb75320; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ebb724f0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ebab04b0; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='<IDEProvisioningBasicTeam: 0x7f80ec573f20; teamID='X33L4FM4WC', teamName='方駿 石'>'>
	<IDEDistributionContext: 0x7f80ec512460; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='<IDEDistributionMethodAdHoc: 0x7f80ec073fa0>', team='(null)'>
	<IDEDistributionContext: 0x7f80ec434440; archive = '<IDEArchive: 0x7f80ebdce350>', distributionMethod='(null)', team='(null)'>
</IDEDistributionProcessingPipelineContext: 0x7f80ec44c9d0>
2018-04-03 06:32:43 +0000  Processing step: IDEDistributionCreateDestRootStep
2018-04-03 06:32:43 +0000  Processing step: IDEDistributionCopyItemStep
2018-04-03 06:32:43 +0000  Running /usr/bin/ditto '-V' '/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app' '/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app'
2018-04-03 06:32:43 +0000  >>> Copying /Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app 
2018-04-03 06:32:43 +0000  copying file ./_CodeSignature/CodeResources ... 
2018-04-03 06:32:43 +0000  11223 bytes for ./_CodeSignature/CodeResources
2018-04-03 06:32:43 +0000  copying file ./Base.lproj/Main.storyboardc/UINavigationController-M3X-ty-Ee3.nib ... 
2018-04-03 06:32:43 +0000  2111 bytes for ./Base.lproj/Main.storyboardc/UINavigationController-M3X-ty-Ee3.nib
2018-04-03 06:32:43 +0000  copying file ./Base.lproj/Main.storyboardc/BYZ-38-t0r-view-8bC-Xf-vdC.nib ... 
2018-04-03 06:32:43 +0000  2939 bytes for ./Base.lproj/Main.storyboardc/BYZ-38-t0r-view-8bC-Xf-vdC.nib
copying file ./Base.lproj/Main.storyboardc/Info.plist ... 
2018-04-03 06:32:43 +0000  276 bytes for ./Base.lproj/Main.storyboardc/Info.plist
2018-04-03 06:32:43 +0000  copying file ./Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib ... 
2018-04-03 06:32:43 +0000  1136 bytes for ./Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib
copying file ./Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib ... 
2018-04-03 06:32:43 +0000  832 bytes for ./Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib
2018-04-03 06:32:43 +0000  copying file ./Base.lproj/LaunchScreen.storyboardc/Info.plist ... 
2018-04-03 06:32:43 +0000  258 bytes for ./Base.lproj/LaunchScreen.storyboardc/Info.plist
2018-04-03 06:32:43 +0000  copying file ./dvc.mlmodelc/model.espresso.shape ... 
2018-04-03 06:32:43 +0000  13385 bytes for ./dvc.mlmodelc/model.espresso.shape
copying file ./dvc.mlmodelc/model.espresso.net ... 
2018-04-03 06:32:43 +0000  68737 bytes for ./dvc.mlmodelc/model.espresso.net
2018-04-03 06:32:43 +0000  copying file ./dvc.mlmodelc/model.espresso.weights ... 
2018-04-03 06:32:43 +0000  87341760 bytes for ./dvc.mlmodelc/model.espresso.weights
2018-04-03 06:32:44 +0000  copying file ./dvc.mlmodelc/model/coremldata.bin ... 
200 bytes for ./dvc.mlmodelc/model/coremldata.bin
copying file ./dvc.mlmodelc/coremldata.bin ... 
244 bytes for ./dvc.mlmodelc/coremldata.bin
copying file ./Dog or Cat ... 
359200 bytes for ./Dog or Cat
copying file ./Assets.car ... 
153752 bytes for ./Assets.car
copying file ./Frameworks/libswiftCoreImage.dylib ... 
307632 bytes for ./Frameworks/libswiftCoreImage.dylib
copying file ./Frameworks/libswiftObjectiveC.dylib ... 
554096 bytes for ./Frameworks/libswiftObjectiveC.dylib
copying file ./Frameworks/libswiftVision.dylib ... 
309312 bytes for ./Frameworks/libswiftVision.dylib
copying file ./Frameworks/libswiftCore.dylib ... 
2018-04-03 06:32:44 +0000  66629568 bytes for ./Frameworks/libswiftCore.dylib
copying file ./Frameworks/libswiftCoreGraphics.dylib ... 
2018-04-03 06:32:44 +0000  1628560 bytes for ./Frameworks/libswiftCoreGraphics.dylib
copying file ./Frameworks/libswiftUIKit.dylib ... 
1043024 bytes for ./Frameworks/libswiftUIKit.dylib
copying file ./Frameworks/libswiftMetal.dylib ... 
448896 bytes for ./Frameworks/libswiftMetal.dylib
copying file ./Frameworks/libswiftDispatch.dylib ... 
2722304 bytes for ./Frameworks/libswiftDispatch.dylib
copying file ./Frameworks/libswiftos.dylib ... 
497152 bytes for ./Frameworks/libswiftos.dylib
copying file ./Frameworks/libswiftCoreFoundation.dylib ... 
257744 bytes for ./Frameworks/libswiftCoreFoundation.dylib
copying file ./Frameworks/libswiftDarwin.dylib ... 
838736 bytes for ./Frameworks/libswiftDarwin.dylib
copying file ./Frameworks/libswiftQuartzCore.dylib ... 
2018-04-03 06:32:44 +0000  310608 bytes for ./Frameworks/libswiftQuartzCore.dylib
copying file ./Frameworks/libswiftFoundation.dylib ... 
2018-04-03 06:32:44 +0000  30131392 bytes for ./Frameworks/libswiftFoundation.dylib
copying file ./Frameworks/libswiftsimd.dylib ... 
2018-04-03 06:32:44 +0000  5580000 bytes for ./Frameworks/libswiftsimd.dylib
2018-04-03 06:32:44 +0000  2018-04-03 06:32:44 +0000  /usr/bin/ditto exited with 0

2018-04-03 06:32:44 +0000  copying file ./embedded.mobileprovision ... 
7602 bytes for ./embedded.mobileprovision
copying file ./Info.plist ... 
1391 bytes for ./Info.plist
copying file ./PkgInfo ... 
8 bytes for ./PkgInfo
2018-04-03 06:32:44 +0000  Processing step: IDEDistributionEmbedProfileStep
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec546520 'com.apple.dt.runtime.swiftCore' '<DVTFilePath:0x7f80ebe735b0:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftCore.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec516030 'com.apple.dt.runtime.swiftCoreFoundation' '<DVTFilePath:0x7f80ec545680:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftCoreFoundation.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec55f8e0 'com.apple.dt.runtime.swiftCoreGraphics' '<DVTFilePath:0x7f80ec410350:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftCoreGraphics.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ebb76dd0 'com.apple.dt.runtime.swiftCoreImage' '<DVTFilePath:0x7f80ec54c8a0:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftCoreImage.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec1bb140 'com.apple.dt.runtime.swiftDarwin' '<DVTFilePath:0x7f80ec54e0b0:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftDarwin.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec1ba850 'com.apple.dt.runtime.swiftDispatch' '<DVTFilePath:0x7f80ec1b6b40:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftDispatch.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec1c8f90 'com.apple.dt.runtime.swiftFoundation' '<DVTFilePath:0x7f80ec5458a0:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftFoundation.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec42d510 'com.apple.dt.runtime.swiftMetal' '<DVTFilePath:0x7f80ec40d270:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftMetal.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec552a80 'com.apple.dt.runtime.swiftObjectiveC' '<DVTFilePath:0x7f80ebb72f20:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftObjectiveC.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ebb6a110 'com.apple.dt.runtime.swiftQuartzCore' '<DVTFilePath:0x7f80ec52a050:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftQuartzCore.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec1b3f70 'com.apple.dt.runtime.swiftUIKit' '<DVTFilePath:0x7f80ec412500:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftUIKit.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec53a740 'com.apple.dt.runtime.swiftVision' '<DVTFilePath:0x7f80ebae5c40:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftVision.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ec41df80 'com.apple.dt.runtime.swiftos' '<DVTFilePath:0x7f80ec556c40:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftos.dylib'>'>
2018-04-03 06:32:44 +0000  Skipping profile for item: <IDEDistributionItem: 0x7f80ebe8be90 'com.apple.dt.runtime.swiftsimd' '<DVTFilePath:0x7f80ebab0f10:'/Users/JuneRobin/Library/Developer/Xcode/Archives/2018-04-03/Dog or Cat 2018-4-3 下午2.31.xcarchive/Products/Applications/Dog or Cat.app/Frameworks/libswiftsimd.dylib'>'>
2018-04-03 06:32:44 +0000  Processing step: IDEDistributionAppThinningPlistStep
2018-04-03 06:32:44 +0000  Skipping step: IDEDistributionAppThinningPlistStep because it said so
2018-04-03 06:32:44 +0000  Processing step: IDEDistributionCompileBitcodeStep
2018-04-03 06:32:44 +0000  Running /Applications/Xcode.app/Contents/Developer/usr/bin/ipatool '/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root' '--json' '/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/ipatool-json-filepath-y7aNkn' '--compile-bitcode' '--output' '/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/IDEIPAProcessor.AppThinning.r3p' '--toolchain' '/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr' '--platforms' '/Applications/Xcode.app/Contents/Developer/Platforms'
2018-04-03 06:32:44 +0000  ruby 2.3.3p222 (2016-11-21 revision 56859) [universal.x86_64-darwin17]
2018-04-03 06:32:45 +0000  /System/Library/Frameworks/Ruby.framework/Versions/2.3/usr/lib/ruby/gems/2.3.0/gems/CFPropertyList-2.2.8/lib/cfpropertylist/rbCFPropertyList.rb:98: warning: assigned but unused variable - temp
/System/Library/Frameworks/Ruby.framework/Versions/2.3/usr/lib/ruby/gems/2.3.0/gems/CFPropertyList-2.2.8/lib/cfpropertylist/rbCFPropertyList.rb:109: warning: assigned but unused variable - e
2018-04-03 06:32:45 +0000  /System/Library/Frameworks/Ruby.framework/Versions/2.3/usr/lib/ruby/gems/2.3.0/gems/libxml-ruby-2.9.0/lib/libxml/schema/type.rb:8: warning: method redefined; discarding old annotation
2018-04-03 06:32:45 +0000  /System/Library/Frameworks/Ruby.framework/Versions/2.3/usr/lib/ruby/gems/2.3.0/gems/libxml-ruby-2.9.0/lib/libxml/schema/element.rb:18: warning: method redefined; discarding old annotation
2018-04-03 06:32:45 +0000  OS X 10.13.4 17E199
2018-04-03 06:32:45 +0000  ENV: {"PATH"=>"/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin:/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/local/bin:/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/libexec:/Applications/Xcode.app/Contents/Developer/usr/bin:/Applications/Xcode.app/Contents/Developer/usr/local/bin:/Applications/Xcode.app/Contents/Developer/Tools:/usr/bin:/bin:/usr/sbin:/sbin", "MallocNanoZone"=>"0", "TMPDIR"=>"/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/", "LOGNAME"=>"JuneRobin", "HOME"=>"/Users/JuneRobin", "XPC_FLAGS"=>"0x0", "Apple_PubSub_Socket_Render"=>"/private/tmp/com.apple.launchd.4OcJ4FYXIY/Render", "USER"=>"JuneRobin", "SSH_AUTH_SOCK"=>"/private/tmp/com.apple.launchd.h9igc14cP5/Listeners", "DISPLAY"=>"/private/tmp/com.apple.launchd.8at6T1SFSc/org.macosforge.xquartz:0", "XPC_SERVICE_NAME"=>"com.apple.dt.Xcode.23708", "SHELL"=>"/bin/bash", "__CF_USER_TEXT_ENCODING"=>"0x1F5:0x2:0x35", "CA_DEBUG_TRANSACTIONS"=>"1"}
ARGV: ["/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root", "--json", "/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/ipatool-json-filepath-y7aNkn", "--compile-bitcode", "--output", "/var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/IDEIPAProcessor.AppThinning.r3p", "--toolchain", "/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr", "--platforms", "/Applications/Xcode.app/Contents/Developer/Platforms"]
2018-04-03 06:32:45 +0000  warning: Configuration issue: platform AppleTVSimulator.platform doesn't have any non-simulator SDKs; ignoring it
2018-04-03 06:32:45 +0000  warning: Configuration issue: platform WatchSimulator.platform doesn't have any non-simulator SDKs; ignoring it
2018-04-03 06:32:45 +0000  warning: Configuration issue: platform iPhoneSimulator.platform doesn't have any non-simulator SDKs; ignoring it
2018-04-03 06:32:45 +0000  Scanning IPA...
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Assets.car
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8794 exit 0
    Stdout:
        Mac OS X bill of materials (BOM) file
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Base.lproj/LaunchScreen.storyboardc/01J-lp-oVM-view-Ze5-6b-2t3.nib
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8796 exit 0
    Stdout:
        data
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Base.lproj/LaunchScreen.storyboardc/Info.plist
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8797 exit 0
    Stdout:
        Apple binary property list
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Base.lproj/LaunchScreen.storyboardc/UIViewController-01J-lp-oVM.nib
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8798 exit 0
    Stdout:
        data
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Base.lproj/Main.storyboardc/BYZ-38-t0r-view-8bC-Xf-vdC.nib
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8800 exit 0
    Stdout:
        data
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Base.lproj/Main.storyboardc/Info.plist
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8801 exit 0
    Stdout:
        Apple binary property list
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Base.lproj/Main.storyboardc/UINavigationController-M3X-ty-Ee3.nib
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8802 exit 0
    Stdout:
        data
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Dog\ or\ Cat
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8803 exit 0
    Stdout:
        Mach-O 64-bit executable arm64
    
    Stderr:
2018-04-03 06:32:45 +0000  /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/lipo -info /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Dog\ or\ Cat
2018-04-03 06:32:45 +0000      /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/lipo exited with pid 8804 exit 0
    Stdout:
        Non-fat file: /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Dog or Cat is architecture: arm64
    
    Stderr:
2018-04-03 06:32:45 +0000  /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool -h -v -m -arch all /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Dog\ or\ Cat
2018-04-03 06:32:45 +0000      /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool exited with pid 8805 exit 0
    Stdout:
        Mach header
              magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags
        MH_MAGIC_64   ARM64        ALL  0x00     EXECUTE    38       4248   NOUNDEFS DYLDLINK TWOLEVEL PIE
    
    Stderr:
2018-04-03 06:32:45 +0000  /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool -l -v -m -arch arm64 /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Dog\ or\ Cat
2018-04-03 06:32:45 +0000      /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool exited with pid 8807 exit 0
    Stdout:
        /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Dog or Cat:
        Mach header
              magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags
        MH_MAGIC_64   ARM64        ALL  0x00     EXECUTE    38       4248   NOUNDEFS DYLDLINK TWOLEVEL PIE
        Load command 0
              cmd LC_SEGMENT_64
          cmdsize 72
          segname __PAGEZERO
           vmaddr 0x0000000000000000
           vmsize 0x0000000100000000
          fileoff 0
         filesize 0
          maxprot ---
         initprot ---
           nsects 0
            flags (none)
        Load command 1
              cmd LC_SEGMENT_64
          cmdsize 1192
          segname __TEXT
           vmaddr 0x0000000100000000
           vmsize 0x0000000000010000
          fileoff 0
         filesize 65536
          maxprot r-x
         initprot r-x
           nsects 14
            flags (none)
        Section
          sectname __text
           segname __TEXT
              addr 0x0000000100005148
              size 0x0000000000007838
            offset 20808
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes PURE_INSTRUCTIONS SOME_INSTRUCTIONS
         reserved1 0
         reserved2 0
        Section
          sectname __stubs
           segname __TEXT
              addr 0x000000010000c980
              size 0x00000000000003b4
            offset 51584
             align 2^1 (2)
            reloff 0
            nreloc 0
              type S_SYMBOL_STUBS
        attributes PURE_INSTRUCTIONS SOME_INSTRUCTIONS
         reserved1 0 (index into indirect symbol table)
         reserved2 12 (size of stubs)
        Section
          sectname __stub_helper
           segname __TEXT
              addr 0x000000010000cd34
              size 0x00000000000003cc
            offset 52532
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes PURE_INSTRUCTIONS SOME_INSTRUCTIONS
         reserved1 0
         reserved2 0
        Section
          sectname __const
           segname __TEXT
              addr 0x000000010000d100
              size 0x00000000000004e0
            offset 53504
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __cstring
           segname __TEXT
              addr 0x000000010000d5e0
              size 0x0000000000001065
            offset 54752
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_CSTRING_LITERALS
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_methname
           segname __TEXT
              addr 0x000000010000e645
              size 0x0000000000000e9d
            offset 58949
             align 2^0 (1)
            reloff 0
            nreloc 0
              type S_CSTRING_LITERALS
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_typeref
           segname __TEXT
              addr 0x000000010000f4f0
              size 0x000000000000033b
            offset 62704
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_reflstr
           segname __TEXT
              addr 0x000000010000f830
              size 0x0000000000000076
            offset 63536
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_fieldmd
           segname __TEXT
              addr 0x000000010000f8a8
      
2018-04-03 06:32:45 +0000          size 0x0000000000000154
            offset 63656
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_capture
           segname __TEXT
              addr 0x000000010000f9fc
              size 0x0000000000000010
            offset 63996
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_assocty
           segname __TEXT
              addr 0x000000010000fa0c
              size 0x0000000000000060
            offset 64012
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift2_proto
           segname __TEXT
              addr 0x000000010000fa70
              size 0x00000000000000a0
            offset 64112
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __unwind_info
           segname __TEXT
              addr 0x000000010000fb10
              size 0x0000000000000264
            offset 64272
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __eh_frame
           segname __TEXT
              addr 0x000000010000fd78
              size 0x0000000000000280
            offset 64888
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Load command 2
              cmd LC_SEGMENT_64
          cmdsize 1112
          segname __DATA
           vmaddr 0x0000000100010000
           vmsize 0x0000000000004000
          fileoff 65536
         filesize 16384
          maxprot rw-
         initprot rw-
           nsects 13
            flags (none)
        Section
          sectname __got
           segname __DATA
              addr 0x0000000100010000
              size 0x0000000000000168
            offset 65536
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_NON_LAZY_SYMBOL_POINTERS
        attributes (none)
         reserved1 79 (index into indirect symbol table)
         reserved2 0
        Section
          sectname __la_symbol_ptr
           segname __DATA
              addr 0x0000000100010168
              size 0x0000000000000278
            offset 65896
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_LAZY_SYMBOL_POINTERS
        attributes (none)
         reserved1 124 (index into indirect symbol table)
         reserved2 0
        Section
          sectname __const
           segname __DATA
              addr 0x00000001000103e0
              size 0x0000000000000078
            offset 66528
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_classlist
           segname __DATA
              addr 0x0000000100010458
              size 0x0000000000000028
            offset 66648
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes NO_DEAD_STRIP
         reserved1 0
         reserved2 0
        Section
          sectname __objc_protolist
           segname __DATA
              addr 0x0000000100010480
              size 0x0000000000000028
            offset 66688
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sect
2018-04-03 06:32:45 +0000  name __objc_imageinfo
           segname __DATA
              addr 0x00000001000104a8
              size 0x0000000000000008
            offset 66728
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_const
           segname __DATA
              addr 0x00000001000104b0
              size 0x0000000000001be0
            offset 66736
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_selrefs
           segname __DATA
              addr 0x0000000100012090
              size 0x00000000000000f8
            offset 73872
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_LITERAL_POINTERS
        attributes NO_DEAD_STRIP
         reserved1 0
         reserved2 0
        Section
          sectname __objc_protorefs
           segname __DATA
              addr 0x0000000100012188
              size 0x0000000000000028
            offset 74120
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_classrefs
           segname __DATA
              addr 0x00000001000121b0
              size 0x0000000000000088
            offset 74160
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes NO_DEAD_STRIP
         reserved1 0
         reserved2 0
        Section
          sectname __objc_data
           segname __DATA
              addr 0x0000000100012238
              size 0x00000000000001e0
            offset 74296
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __data
           segname __DATA
              addr 0x0000000100012418
              size 0x00000000000006a0
            offset 74776
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __bss
           segname __DATA
              addr 0x0000000100012ab8
              size 0x0000000000000038
            offset 0
             align 2^3 (8)
            reloff 0
            nreloc 0
              type S_ZEROFILL
        attributes (none)
         reserved1 0
         reserved2 0
        Load command 3
              cmd LC_SEGMENT_64
          cmdsize 152
          segname __LLVM
           vmaddr 0x0000000100014000
           vmsize 0x000000000003c000
          fileoff 81920
         filesize 245760
          maxprot rw-
         initprot rw-
           nsects 1
            flags NORELOC
        Section
          sectname __bundle
           segname __LLVM
              addr 0x0000000100014000
              size 0x000000000003b47e
            offset 81920
             align 2^0 (1)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Load command 4
              cmd LC_SEGMENT_64
          cmdsize 72
          segname __LINKEDIT
           vmaddr 0x0000000100050000
           vmsize 0x0000000000008000
          fileoff 327680
         filesize 31520
          maxprot r--
         initprot r--
           nsects 0
            flags (none)
        Load command 5
                    cmd LC_DYLD_INFO_ONLY
                cmdsize 48
             rebase_off 327680
            rebase_size 512
               bind_off 328192
              bind_size 3544
          weak_bind_off 0
         weak_bind_size 0
          lazy_bind_off 331736
         lazy_bind_size 3344
             export_off 335080
            export_size 48
        Load command 6
     
2018-04-03 06:32:45 +0000          cmd LC_SYMTAB
         cmdsize 24
          symoff 335352
           nsyms 169
          stroff 338868
         strsize 5672
        Load command 7
                    cmd LC_DYSYMTAB
                cmdsize 80
              ilocalsym 0
              nlocalsym 1
             iextdefsym 1
             nextdefsym 1
              iundefsym 2
              nundefsym 167
                 tocoff 0
                   ntoc 0
              modtaboff 0
                nmodtab 0
           extrefsymoff 0
            nextrefsyms 0
         indirectsymoff 338056
          nindirectsyms 203
              extreloff 0
                nextrel 0
              locreloff 0
                nlocrel 0
        Load command 8
                  cmd LC_LOAD_DYLINKER
              cmdsize 32
                 name /usr/lib/dyld (offset 12)
        Load command 9
             cmd LC_UUID
         cmdsize 24
            uuid 9CC0D7F8-7A11-39B3-B8CB-F22529051091
        Load command 10
              cmd LC_VERSION_MIN_IPHONEOS
          cmdsize 16
          version 11.0
              sdk 11.3
        Load command 11
              cmd LC_SOURCE_VERSION
          cmdsize 16
          version 0.0
        Load command 12
               cmd LC_MAIN
           cmdsize 24
          entryoff 22516
         stacksize 0
        Load command 13
                  cmd LC_ENCRYPTION_INFO_64
              cmdsize 24
             cryptoff 16384
            cryptsize 49152
              cryptid 0
                  pad 0
        Load command 14
                  cmd LC_LOAD_DYLIB
              cmdsize 88
                 name /System/Library/Frameworks/Foundation.framework/Foundation (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 1452.23.0
        compatibility version 300.0.0
        Load command 15
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name /usr/lib/libobjc.A.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 228.0.0
        compatibility version 1.0.0
        Load command 16
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name /usr/lib/libSystem.B.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 1252.50.4
        compatibility version 1.0.0
        Load command 17
                  cmd LC_LOAD_DYLIB
              cmdsize 88
                 name /System/Library/Frameworks/CoreImage.framework/CoreImage (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 5.0.0
        compatibility version 1.0.0
        Load command 18
                  cmd LC_LOAD_DYLIB
              cmdsize 80
                 name /System/Library/Frameworks/CoreML.framework/CoreML (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 1.0.0
        compatibility version 1.0.0
        Load command 19
                  cmd LC_LOAD_DYLIB
              cmdsize 80
                 name /System/Library/Frameworks/UIKit.framework/UIKit (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 3698.52.10
        compatibility version 1.0.0
        Load command 20
                  cmd LC_LOAD_DYLIB
              cmdsize 80
                 name /System/Library/Frameworks/Vision.framework/Vision (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 1.5.3
        compatibility version 1.0.0
        Load command 21
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftCore.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 22
                  cmd LC_LOAD_DYLIB
              cmdsize 64
                 name @rpath/libswiftCoreFoundation.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 23
   
2018-04-03 06:32:45 +0000                 cmd LC_LOAD_DYLIB
              cmdsize 64
                 name @rpath/libswiftCoreGraphics.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 24
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftCoreImage.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 25
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftDarwin.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 26
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftDispatch.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 27
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftFoundation.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 28
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftMetal.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 29
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftObjectiveC.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 30
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftQuartzCore.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 31
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftUIKit.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 32
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftVision.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 33
                  cmd LC_LOAD_DYLIB
              cmdsize 56
                 name @rpath/libswiftsimd.dylib (offset 24)
           time stamp 2 Thu Jan  1 08:00:02 1970
              current version 902.0.48
        compatibility version 1.0.0
        Load command 34
                  cmd LC_RPATH
              cmdsize 40
                 path @executable_path/Frameworks (offset 12)
        Load command 35
              cmd LC_FUNCTION_STARTS
          cmdsize 16
          dataoff 335128
         datasize 224
        Load command 36
              cmd LC_DATA_IN_CODE
          cmdsize 16
          dataoff 335352
         datasize 0
        Load command 37
              cmd LC_CODE_SIGNATURE
          cmdsize 16
          dataoff 344544
         datasize 14656
    
    Stderr:
2018-04-03 06:32:45 +0000  /usr/bin/file -b -- /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Frameworks/libswiftCore.dylib
2018-04-03 06:32:45 +0000      /usr/bin/file exited with pid 8809 exit 0
    Stdout:
        Mach-O universal binary with 3 architectures: [arm_v7:Mach-O dynamically linked shared library arm_v7] [arm64]
        /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Frameworks/libswiftCore.dylib (for architecture armv7):	Mach-O dynamically linked shared library arm_v7
        /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Frameworks/libswiftCore.dylib (for architecture armv7s):	Mach-O dynamically linked shared library arm_v7s
        /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Frameworks/libswiftCore.dylib (for architecture arm64):	Mach-O 64-bit dynamically linked shared library arm64
    
    Stderr:
2018-04-03 06:32:45 +0000  /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/lipo -info /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Frameworks/libswiftCore.dylib
2018-04-03 06:32:45 +0000      /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/lipo exited with pid 8810 exit 0
    Stdout:
        Architectures in the fat file: /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Frameworks/libswiftCore.dylib are: armv7 armv7s arm64 
    
    Stderr:
2018-04-03 06:32:45 +0000  /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool -h -v -m -arch all /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Frameworks/libswiftCore.dylib
2018-04-03 06:32:45 +0000      /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool exited with pid 8811 exit 0
    Stdout:
        Mach header
              magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags
           MH_MAGIC     ARM         V7  0x00       DYLIB    21       3720   NOUNDEFS DYLDLINK TWOLEVEL BINDS_TO_WEAK NO_REEXPORTED_DYLIBS APP_EXTENSION_SAFE
        Mach header
              magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags
           MH_MAGIC     ARM        V7S  0x00       DYLIB    21       3720   NOUNDEFS DYLDLINK TWOLEVEL BINDS_TO_WEAK NO_REEXPORTED_DYLIBS APP_EXTENSION_SAFE
        Mach header
              magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags
        MH_MAGIC_64   ARM64        ALL  0x00       DYLIB    21       4464   NOUNDEFS DYLDLINK TWOLEVEL BINDS_TO_WEAK NO_REEXPORTED_DYLIBS APP_EXTENSION_SAFE
    
    Stderr:
2018-04-03 06:32:45 +0000  /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool -l -v -m -arch armv7 /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog\ or\ Cat.app/Frameworks/libswiftCore.dylib
2018-04-03 06:32:45 +0000      /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/otool exited with pid 8813 exit 0
    Stdout:
        /var/folders/9p/450x9c493lz66bvdg2b_pfdm0000gn/T/XcodeDistPipeline.LQF/Root/Payload/Dog or Cat.app/Frameworks/libswiftCore.dylib:
        Mach header
              magic cputype cpusubtype  caps    filetype ncmds sizeofcmds      flags
           MH_MAGIC     ARM         V7  0x00       DYLIB    21       3720   NOUNDEFS DYLDLINK TWOLEVEL BINDS_TO_WEAK NO_REEXPORTED_DYLIBS APP_EXTENSION_SAFE
        Load command 0
              cmd LC_SEGMENT
          cmdsize 1348
          segname __TEXT
           vmaddr 0x00000000
           vmsize 0x0037c000
          fileoff 0
         filesize 3653632
          maxprot r-x
         initprot r-x
           nsects 19
            flags (none)
        Section
          sectname __text
           segname __TEXT
              addr 0x000077f0
              size 0x0034a020
            offset 30704
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes PURE_INSTRUCTIONS SOME_INSTRUCTIONS
         reserved1 0
         reserved2 0
        Section
          sectname __picsymbolstub4
           segname __TEXT
              addr 0x00351810
              size 0x00000db0
            offset 3479568
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_SYMBOL_STUBS
        attributes PURE_INSTRUCTIONS SOME_INSTRUCTIONS
         reserved1 0 (index into indirect symbol table)
         reserved2 16 (size of stubs)
        Section
          sectname __stub_helper
           segname __TEXT
              addr 0x003525c0
              size 0x00000a38
            offset 3483072
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes PURE_INSTRUCTIONS SOME_INSTRUCTIONS
         reserved1 0
         reserved2 0
        Section
          sectname __cstring
           segname __TEXT
              addr 0x00353000
              size 0x00009395
            offset 3485696
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_CSTRING_LITERALS
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __const
           segname __TEXT
              addr 0x0035c3a0
              size 0x00009a6e
            offset 3523488
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_methname
           segname __TEXT
              addr 0x00365e0e
              size 0x00000668
            offset 3563022
             align 2^0 (1)
            reloff 0
            nreloc 0
              type S_CSTRING_LITERALS
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_typeref
           segname __TEXT
              addr 0x00366480
              size 0x00007204
            offset 3564672
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_capture
           segname __TEXT
              addr 0x0036d684
              size 0x00001318
            offset 3593860
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_reflstr
           segname __TEXT
              addr 0x0036e9a0
              size 0x00000e4f
            offset 3598752
             align 2^4 (16)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_fieldmd
           segname __TEXT
              addr 0x0036f7f0
              size 0x00003bc8
            o
2018-04-03 06:32:45 +0000  ffset 3602416
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __ustring
           segname __TEXT
              addr 0x003733b8
              size 0x00000014
            offset 3617720
             align 2^1 (2)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_assocty
           segname __TEXT
              addr 0x003733cc
              size 0x000044a0
            offset 3617740
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift2_proto
           segname __TEXT
              addr 0x0037786c
              size 0x00003ca0
            offset 3635308
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift2_types
           segname __TEXT
              addr 0x0037b50c
              size 0x00000310
            offset 3650828
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __swift3_builtin
           segname __TEXT
              addr 0x0037b81c
              size 0x00000258
            offset 3651612
             align 2^2 (4)
            reloff 0
            nreloc 0
              type S_REGULAR
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_classname
           segname __TEXT
              addr 0x0037ba74
              size 0x000000fd
            offset 3652212
             align 2^0 (1)
            reloff 0
            nreloc 0
              type S_CSTRING_LITERALS
        attributes (none)
         reserved1 0
         reserved2 0
        Section
          sectname __objc_methtype
           segname __TEXT
              addr 0x0037bb71
              size 0x00000212
            offset 3652465
             align 2^0 (1)
            reloff 0
            nreloc 0
              type S_CSTRING_LITERALS
        attributes (none)
         reserved1 0
